export const state = () => ({
  currentIndex: 0,
  cards: [
    {
      title: 'Брендинг',
      description:
        'Ми допоможемо ефективно сформувати цілісне уявлення про ваш товар чи послугу у свідомості споживача. Ми впевнені, що надлишок інформації породжує дефіцит уваги. Грамотний брендинг - це інвестиція, яка помножить ваш дохід. OLDORCS пропонує ефективні інструменти просування з індивідуальним підходом до кожного бізнесу.\n Бренд - це не модне слово. Бренд - це про ваш успіх.',
      img: '/img/branding.jpg'
    },
    {
      title: 'Графічний дизайн',
      description:
        '86% інформації людина сприймає очима. \n Так, картинка має велике значення. \n Ми займаємось рекламним дизайном 10 років. Впевнені, що у рекламі креативним є той дизайн, який продає.',
      img: '/img/graphic-design.jpg'
    },
    {
      title: 'Професійний друк',
      description:
        'Перлини, мереживо, золото, метал, вельвет, полотно, синтетика, пластик, дерево, скло.. Все це про текстуру паперу, на якому друкується реклама, декор, постери, фірмова айдентика, запрошення.. Тактильність - ще один важливий і недооцінений аспект у продажах. Його вплив на формування позитивного рішення споживача - беззаперечний. \n Пам’ятайте, що ідеальний дизайн повинен бути ідеально підготовленим для подальшого друку та використання. Плотність та колір паперу, текстура, покриття, якість фарби, витин, перегин, клейкість, переведення кольорів, зображень, тексту.. Все це - про професійний друк OLDORCS.',
      img: '/img/pofessional-printing.jpg'
    },
    {
      title: 'Оперативна поліграфія',
      description:
        '1 день або поки ви п’єте каву😉. \n Оперативніше точно не буває. \n Ми цінуємо час. Свій і Ваш.',
      img: '/img/operative-polygraphy.jpg'
    },
    {
      title: 'Смм',
      description:
        'Хороший SMM-менеджер зацікавлений у ваших продажах, а не вашій популярності. Чи варто наймати професійного smm? Однозначно і тільки професійного. \n З вашим профілем працюватимуть: копірайтер, редактор, графічний дизайнер, фотограф/відеограф, маркетолог. \n Аналіз та створення цільової аудиторії, ефективні методи просування, співпраця з блогерами, естетика візуалу.',
      img: '/img/smm-marketing.jpg'
    },
    {
      title: 'Зовнішня реклама',
      description:
        'Білборд багато може сказати про ваш бізнес. Навіть якщо на ньому лише 1 слово чи найпростіша ілюстрація. Потрібно знати на скільки часу уваги потенційного клієнта ми можемо розраховувати. Це 2 секунди (авто) чи 20 (пішохід)? Надмірний креатив, відсутність потрібних знань типографії можуть добряче знизити трафік та бути дуже затратними. Ми завжди намагаємось знайти ідеальне рішення для нашого клієнта без втрати якості та не за усі гроші світу. \n Якщо це можна зробити дешевше і без втрати якості - ми обов’язково це запропонуємо.',
      img: '/img/outdoor-advertising.jpg'
    },
    {
      title: 'Предметна фотозйомка',
      description:
        'Фото високої якості для подальшого використання в усіх потрібних операціях створення вашої реклами, брендингу та смм. Якщо у вас немає потрібних якісних зображень вашого товару чи послуги - вважайте, що це питання вже вирішене.',
      img: '/img/object-photography.jpg'
    }
  ]
})

export const getters = {
  currentIndex: (state) => {
    return state.currentIndex
  },
  cards: (state) => {
    return state.cards
  }
}

export const mutations = {
  nextIndex: (state) => {
    if (state.currentIndex < state.cards.length - 1) state.currentIndex++
  },
  prevIndex: (state) => {
    if (state.currentIndex > 0) state.currentIndex--
  }
}
